src_ext/Documents/УЗ_СчетНаОплатуQR.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>УЗ_СчетНаОплатуQR</Name>
			<BasedOn>
				<xr:Item>Catalog.УЗ_ФизЛица</xr:Item>
				<xr:Item>Catalog.УЗ_Абонемент</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Плательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>140</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Провайдер</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_ПровайдерыОплатыQR</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_СтатусыОплатыQR</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторQR</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаОплату</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартинкаQR</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдОперацииБанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриходДенег</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УЗ_ПриходДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
						<v8:Type>cfg:DocumentRef.УЗ_ПриходДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Расшифровка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ученик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредметОбучения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Абонемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тариф</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/InformationRegisters/УЗ_Настройки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>УЗ_Настройки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьОкругление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребоватьОписаниеКНеоплаченнымУрокам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТребоватьОписаниеКНеоплаченнымУрокамС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьОповещения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодОповещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОповещатьОЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_ext/Enums/УЗ_СтатусыОплатыQR.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>УЗ_СтатусыОплатыQR</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ожидает</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплачен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Истек</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src_ext/Documents/УЗ_ПриходДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>УЗ_ПриходДенег</Name>
			<BasedOn>
				<xr:Item>Catalog.УЗ_ФизЛица</xr:Item>
				<xr:Item>Catalog.УЗ_Абонемент</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УЗ_СписанияСуммЗаУроки</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_Касса</xr:Item>
				<xr:Item>AccumulationRegister.УЗ_ДвижениеДисконтныхКарт</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Абонемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтатьиДвиженияДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Абонемент</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УЗ_ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Родитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметОбучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ПредметыОбучения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаБонусов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ДисконтныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_ext/Documents/УЗ_СчетНаОплатуQR/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ЭтоНовый() Тогда
		Статус = Перечисления.УЗ_СтатусыОплатыQR.Новый;
		Если Не ЗначениеЗаполнено(Организация) Тогда
			Организация = РегистрыСведений.УЗ_Настройки.Настройки().Организация;
		КонецЕсли;
	КонецЕсли;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.УЗ_ФизЛица") Тогда
		ЗаполнитьПоФизЛицу(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.УЗ_Абонемент") Тогда
		ЗаполнитьПоАбонементу(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("СтрокиОплаты") Тогда
		//из формы прихода денег (кнопка «QR для оплаты»): плательщик и расшифровка платежа
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, "Организация, Плательщик, ДокументОснования");
		Расшифровка.Очистить();
		Для Каждого СтрокаОплаты Из ДанныеЗаполнения.СтрокиОплаты Цикл
			ЗаполнитьЗначенияСвойств(Расшифровка.Добавить(), СтрокаОплаты);
		КонецЦикла;
		СуммаДокумента = Расшифровка.Итог("Сумма");
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	ПрежнийОбъект = ?(ЭтоНовый(), Неопределено, Ссылка.ПолучитьОбъект());
	Если ПрежнийОбъект <> Неопределено И Не ПустаяСтрока(ПрежнийОбъект.ИдентификаторQR) Тогда
		Если ИзмененыДанныеОплаты(ПрежнийОбъект) Тогда
			УЗ_Общий.СообщитьОбОшибкеОбъекта(ЭтотОбъект, НСтр(
				"ru = 'По счёту уже выставлен QR: организацию, плательщика, сумму и расшифровку менять "
				+ "нельзя, даже после отмены. Создайте новый счёт.'"),
				"СуммаДокумента", Отказ);
			Возврат;
		КонецЕсли;
		Если ИдентификаторQR <> ПрежнийОбъект.ИдентификаторQR Тогда
			УЗ_Общий.СообщитьОбОшибкеОбъекта(ЭтотОбъект, НСтр(
				"ru = 'Идентификатор выставленного QR менять нельзя. Для повторной оплаты создайте новый счёт.'"),
				"ИдентификаторQR", Отказ);
			Возврат;
		КонецЕсли;
	КонецЕсли;

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	УЗ_Общий.ЗаполнитьАвтораИОрганизацию(ЭтотОбъект);
	Если Не ЗначениеЗаполнено(Статус) Тогда
		Статус = Перечисления.УЗ_СтатусыОплатыQR.Новый;
	КонецЕсли;
	СуммаДокумента = Расшифровка.Итог("Сумма");
	Если ДополнительныеСвойства.Свойство(УЗ_ОплатыQR.КлючСлужебнойЗаписи()) Тогда
		Возврат;
	КонецЕсли;
	Если ПометкаУдаления И Не ЭтоНовый() И Ссылка.Статус = Перечисления.УЗ_СтатусыОплатыQR.Ожидает Тогда
		УЗ_Общий.СообщитьОбОшибкеОбъекта(ЭтотОбъект, НСтр(
			"ru = 'QR ждёт оплаты: сначала отмените его («Отменить QR»), иначе оплата не станет приходом денег.'"),
			"Статус", Отказ);
		Возврат;
	КонецЕсли;
	Если Не ЭтоНовый() И Ссылка.Статус <> Статус Тогда
		//статус меняет только модуль оплат (банк, отмена)
		Статус = Ссылка.Статус;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если Не ЗначениеЗаполнено(Организация) Тогда
		УЗ_Общий.СообщитьОбОшибкеОбъекта(ЭтотОбъект, НСтр("ru = 'Укажите организацию: деньги придут на её счёт.'"),
			"Организация", Отказ);
	КонецЕсли;
	Для Каждого СтрокаОплаты Из Расшифровка Цикл
		Если Не ЗначениеЗаполнено(СтрокаОплаты.Ученик) Тогда
			УЗ_Общий.СообщитьОбОшибкеОбъекта(ЭтотОбъект, СтрШаблон(НСтр("ru = 'Строка %1: укажите ученика.'"),
				СтрокаОплаты.НомерСтроки), "Расшифровка[" + Формат(СтрокаОплаты.НомерСтроки - 1, "ЧН=0; ЧГ=0")
					+ "].Ученик", Отказ);
		КонецЕсли;
		Если СтрокаОплаты.Сумма < 0 Тогда
			УЗ_Общий.СообщитьОбОшибкеОбъекта(ЭтотОбъект, СтрШаблон(НСтр(
				"ru = 'Строка %1: сумма не может быть отрицательной.'"),
				СтрокаОплаты.НомерСтроки), "Расшифровка[" + Формат(СтрокаОплаты.НомерСтроки - 1, "ЧН=0; ЧГ=0")
					+ "].Сумма", Отказ);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Статус = Перечисления.УЗ_СтатусыОплатыQR.Новый;
	Провайдер = Перечисления.УЗ_ПровайдерыОплатыQR.ПустаяСсылка();
	ИдентификаторQR = "";
	СсылкаНаОплату = "";
	КартинкаQR = Новый ХранилищеЗначения(Неопределено);
	СрокДействия = '00010101';
	ДатаОплаты = '00010101';
	ИдОперацииБанка = "";
	ПриходДенег = Документы.УЗ_ПриходДенег.ПустаяСсылка();
	ТекстОшибки = "";
	АвторДокумента = Неопределено;
	ДокументОснования = Неопределено;
	//абонемент оплачивается один раз: в копии строки без абонементов (как копия прихода денег)
	Для Каждого СтрокаОплаты Из Расшифровка Цикл
		СтрокаОплаты.Абонемент = Справочники.УЗ_Абонемент.ПустаяСсылка();
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//Карточка человека: платит за других (он в их плательщиках) — он плательщик, строки — долги его учеников; иначе он
//ученик — плательщик основной (нет — платит сам), строки — его долги. Долгов нет — строка ученика без суммы.
Процедура ЗаполнитьПоФизЛицу(ФизЛицо)

	ДокументОснования = ФизЛицо;
	Ученики = Справочники.УЗ_ФизЛица.УченикиПлательщика(ФизЛицо);
	Если Ученики.Количество() > 0 Тогда
		Плательщик = ФизЛицо;
	Иначе
		Плательщик = Справочники.УЗ_ФизЛица.ОсновнойПлательщик(ФизЛицо);
		Ученики.Добавить(ФизЛицо);
	КонецЕсли;
	Расшифровка.Очистить();
	Для Каждого СтрокаДолга Из УЗ_ОплатыQR.СтрокиПоДолгам(Ученики, Организация) Цикл
		ЗаполнитьЗначенияСвойств(Расшифровка.Добавить(), СтрокаДолга);
	КонецЦикла;
	Если Расшифровка.Количество() = 0 Тогда
		Расшифровка.Добавить().Ученик = Ученики[0];
	КонецЕсли;
	СуммаДокумента = Расшифровка.Итог("Сумма");

КонецПроцедуры

//Абонемент: его ученик, предмет и организация, сумма — неоплаченный остаток цены (как приход на основании абонемента).
Процедура ЗаполнитьПоАбонементу(Абонемент)

	ДокументОснования = Абонемент;
	Реквизиты = Новый Структура("ФизЛицо, Организация, ПредметОбучения");
	ЗаполнитьЗначенияСвойств(Реквизиты, Абонемент);
	Если ЗначениеЗаполнено(Реквизиты.Организация) Тогда
		Организация = Реквизиты.Организация;
	КонецЕсли;
	Плательщик = Справочники.УЗ_ФизЛица.ОсновнойПлательщик(Реквизиты.ФизЛицо);
	Расшифровка.Очистить();
	СтрокаОплаты = Расшифровка.Добавить();
	СтрокаОплаты.Ученик = Реквизиты.ФизЛицо;
	СтрокаОплаты.ПредметОбучения = Реквизиты.ПредметОбучения;
	СтрокаОплаты.Абонемент = Абонемент;
	СтрокаОплаты.Сумма = Справочники.УЗ_Абонемент.ОплатаАбонемента(Абонемент).ОсталосьОплатить;
	СуммаДокумента = СтрокаОплаты.Сумма;

КонецПроцедуры

//Изменились ли данные, по которым банк выставил QR и по которым создастся приход.
Функция ИзмененыДанныеОплаты(Прежний)
	Если Прежний.Организация <> Организация Или Прежний.Плательщик <> Плательщик
		Или Прежний.СуммаДокумента <> СуммаДокумента Или Прежний.Расшифровка.Количество() <> Расшифровка.Количество(
			) Тогда
		Возврат Истина;
	КонецЕсли;
	Для Каждого СтрокаОплаты Из Прежний.Расшифровка Цикл
		Новая = Расшифровка[СтрокаОплаты.НомерСтроки - 1];
		Если Новая.Ученик <> СтрокаОплаты.Ученик Или Новая.ПредметОбучения <> СтрокаОплаты.ПредметОбучения
			Или Новая.Абонемент <> СтрокаОплаты.Абонемент Или Новая.Тариф <> СтрокаОплаты.Тариф
			Или Новая.Сумма <> СтрокаОплаты.Сумма Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;

КонецФункции

#КонецОбласти
